Revit 2027 API
BuiltInFailures.ImageFailures.BadViewType Property
 Image Instances can't be placed in 3D Views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadViewType { get; }
Public Shared ReadOnly Property BadViewType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadViewType {
	FailureDefinitionId^ get ();
}
static member BadViewType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImageFailures Class
Autodesk.Revit.DB Namespace